{
  "positionName": "Junior Web Designer",
  "company": "EDUCATION WEB SOLUTIONS PTY LTD",
  "posted": "22/01/2026",
  "type": "Full Time",
  "location": "Mansfield Park",
  "link": "https://www.seek.com.au/job/89835256?type=standard&ref=search-standalone&origin=jobCard#sol=55c28a2ea9a981f5a3d294db997bb6a960475933",
  "description": "This is a design + WordPress build role. No custom dev required.\n\nAbout EWS\n\nWe build websites for schools and education institutions across Australia. Small team, growing fast, looking for someone who can design clean sites and actually ship them.\n\nIf you want to learn quickly, take on real work early, and grow with a company that's scaling, this could be a good fit.\n\nThe Role\n\nWe want someone driven to work in a fast paced company. You'll be designing and building WordPress sites in Divi (we can train you if you've used other builders like Elementor or Gutenberg).\n\nThis is design first. We care about your eye for layout, typography, spacing and polish more than your coding ability.\n\nThe work is structured enough to learn from but varied enough to stay interesting. You'll work directly with the team, get feedback fast, and see your work go live.\n\nNo custom plugin/theme development required. We would prefer a Graphic Designer than a Web Developer.\n\nIn-office (Mansfield Park, SA) to start so you can learn quickly. Remote flexibility once you're running independently.\n\nWhat You'll Do\n\nDesign and build WordPress websites using Divi\n\nCreate layouts, update content, publish pages\n\nPrepare web assets (banners, images, graphics)\n\nHandle responsive design and fix layout issues\n\nWork from briefs and follow brand guidelines\n\nQA your work before it goes live\n\nWho We're Looking For\n\nExperience level doesn't matter much. How you work does.\n\nYou might be a recent design grad, a graphic designer wanting to build more websites, or a junior designer ready to level up in a growing company.\n\nWhat matters:\n\nStrong design fundamentals (layout, typography, spacing, visual hierarchy)\n\nComfortable with WordPress (uni projects, side work, personal sites all count)\n\nYou communicate well and take feedback\n\nYou finish things instead of endlessly tweaking them\n\nPortfolio required (link or PDF)\n\nNice to Have\n\nDivi experience\n\nBasic HTML/CSS experience\n\nPhotoshop and Illustrator experience\n\nBasic SEO understanding\n\nDetails\n\nHours: 15-30+ per week, flexible. Can grow to full-time.\n\nPay: Based on experience\nPermanent: $28-$34/hour + super\nCasual: $35-$42/hour + super\n\nApply\n\nSend your CV, portfolio, and a quick note about your WordPress experience (what builders you've used).\n\nIf you've got design skills and you're ready to build real work, let's talk."
}