{
  "positionName": "Software Team Lead",
  "company": "Semantic Sciences Pty Ltd",
  "posted": "03/02/2026",
  "type": "Full Time",
  "location": "Adelaide SA",
  "link": "https://www.seek.com.au/job/90083734?type=promoted&ref=search-standalone&origin=jobCard#sol=bb41319a37371db35dd68a31a370e486767e34de",
  "description": "Semantic Sciences – Advanced data science, software design and technology delivery.\n\nSemantic Sciences has pioneered Sensuris, a software solution offering advanced processes and sophisticated algorithms for grant management suitable for the largest grant providers. Sensuris is delivered from the cloud and offers unparalleled automation and efficiency.\n\nSemantic Sciences combines excellence in advanced data science with technology delivery.\n\nWe are a company of diverse & talented individuals with a passion for advanced technology, who love seeing our software benefit humanity.\n\nAt Semantic Sciences, our goal is to create a space where our people have the chance to achieve excellence within a warm and encouraging environment. We strive and excel at creating cutting edge solutions and provide excellent service to our customers.\n\nWe are also in the early stages of development of a new product to deliver advanced assessor assignment capabilities and strengthen our place at the forefront of our industry. \n\nTHE ROLE\n\nThe Software Team Lead is a critical role for Semantic Sciences. This role is pivotal to the continued success of the organisation, with the successful candidate being instrumental in leading the development team in the end-to-end delivery of high-quality software solutions.\n\nKEY RESPONSIBILITIES OF THE ROLE\n\nLead by example and mentor a team of friendly, highly talented Software Engineers, to create excellent code that is well documented, maximises re-use and meets client requirements.\n\nLead the end-to-end development of custom software solutions, evaluate and recommend technologies to solve problems and further the development of capabilities.\n\nLead the design and execution of testing strategies, focusing on maximizing automation coverage and efficiency.\n\nEmbed cyber security principles in all aspects of the development and delivery processes.\n\nLead technical review activities and contribute, research and implement ideas for risk mitigation, software and system improvements.\n\nWHAT’S IN IT FOR YOU\n\nAttractive remuneration – Strong compensation for exceptional people.\n\nHybrid model – We understand the new era of work-life across the office and work from home.\n\nFlexible arrangements – Options available to balance your work and lifestyle needs.\n\nCareer development – Mentoring & development opportunities are a vital part of what we do.\n\nGreat team – We pride ourselves on our collaboration, teamwork and support of one another.\n\nWHO WE ARE LOOKING FOR*\n\nYou'll be an experienced and talented Software Engineering Lead with a mix of hands-on skills and experience in Java EE, Wildfly, REST, GraphQL, Typescript, Vue, Docker, AWS, and Terraform.\n\nYou’ll have the demonstrated ability to carefully set and iteratively improve project requirements and specifications.\n\nYou’ll bring a demonstrated history of collaborating with others to create and improve great ideas.\n\nYou’ll have strong process management skills, with extensive experience organizing software development activities to ensure efficient execution and predictable delivery.\n\nIdeally, you’ll have a demonstrated track record of successfully delivering products from initial concept through to production and ongoing support.\n\nNEXT STEPS\n\nIf you’re enthusiastic about this opportunity and it sounds like you, even if you don’t tick all the boxes, please still get in touch.\n\nIf you have any questions, please contact jobs@semsci.com\n\nOtherwise, please submit your application online at your earliest convenience.\n\n*Applicants must have legal work rights within Australia, and the successful applicant will be required to undertake relevant probity screening, including a criminal history check."
}