{
  "positionName": "Software Engineer – DevSecOps / ICT (JORN Program)",
  "company": "Lockheed Martin Australia Pty Ltd",
  "posted": "05/02/2026",
  "type": "Full Time",
  "location": "Edinburgh",
  "link": "https://www.seek.com.au/job/90142248?type=standard&ref=search-standalone&origin=jobCard#sol=6316c9dab0b5c332de7eb908d3e3008e1094b17f",
  "description": "About us:\n\nAt Lockheed Martin Australia, we believe that when people are empowered, inspired, and supported, they can achieve extraordinary things. We embrace flexibility, so our people can be their best inside and outside of work. We champion inclusion and continuous learning, ensuring all voices are heard and valued. And we thrive on collaboration, turning challenges into opportunities for growth and innovation.  As a leader in national security, our innovative and diverse programs create a more secure future for Australia across space, air, land, sea, and cyber domains. Every day is a chance to solve the world’s most complex challenges and make a profound impact. Experience it here.\n\nThis position is within Lockheed Martin Australia’s Engineering Services Contract (ESC) team, supporting the Jindalee Over the Horizon RADAR Network (JORN).  As part of (ESC) Lockheed Martin provide rapid agile capability development services to the CoA, supporting the evaluation of JORN system enhancements prior to their formal incorporation into the baseline.\n\nAs well as this rapid capability development, we perform an independent V&V test program.  The role of the ESC Software Engineer within the team will encompass the full lifecycle of the DevSecOps and ICT tasks to be performed, while adapting the level of technical assurance to balance risk against the customer timelines.\n\nA key aspect of the role is the ability to adapt solutions to the needs of end users and to maintain an awareness of alternate technologies that may be applicable to the domain.\n\n\n\n\nResponsibilities\n\nWorking under guidance as part of a highly skilled engineering team, you will:\n\n·         Perform DevSecOps and ICT tasks within a Linux-based environment\n\n·         Configure and maintain infrastructure to support software development teams\n\n·         Identify, deploy, and maintain development tools and pipelines\n\n·         Undertake system administration activities\n\n·         Support cyber compliance tasks\n\n·         Assist with resolving issues identified during software development, integration, and testing\n\nYou will also be responsible for resolution of relevant problems identified during the conduct of software development, integration and test.\n\nAbout you:\n\nTo be successful in this role, you will bring:\n\nExperience writing Ansible roles\n\nStrong Linux Administration capability\n\nTooling administration experience\n\nKubernetes knowledge\n\nExperience configuring and running Continuous Integration workers\n\nFamiliarity with logging, metrics collection, and visualisation tools\n\nExperience with RHEL\n\nStrong skills in configuring operating systems (servers, workstations, diskless systems)\n\nKickstart configuration experience\n\nRPM packaging experience\n\nExperience with Satellite configuration and management\n\nUnderstanding of software engineering processes, procedures, and product lifecycles\n\nAbility to apply experiential judgement and lateral thinking to complex problems\n\n \n\nDesirable\n\nKnowledge of SELinux and Auditd\n\nExperience configuring syslog, rsyslog, and logrotate\n\nUnderstanding and tuning of NFS\n\nRepository management experience\n\nExperience implementing ISM compliance\n\nSoftware development in a Linux environment\n\n \n\nHow we reward and support you:\n\nWhen you join Lockheed Martin, you work on projects you won’t experience anywhere else.\n\nWe offer you a range of benefits built to suit you, no matter what stage of life you are in. \n\n·         Flexible work & Hybrid work options\n\n·         Access to our online discounts program offering immediate discounts or cashback\n\n·         A variety of leave options including Purchase Leave to support you and your family  \n\n·         Additional benefits such as Novated Leasing and Fitness Programs\n\n·         Learning & Development platforms to encourage ongoing self-development\n\nSpecial Requirements:\n\nApplicants must be eligible to obtain and maintain an Australian Defence Security Clearance and employment may be contingent on the provision of further personal information including citizenship to ensure compliance with international export control legislation and regulations.\n\nA Veteran-friendly Workplace:\n\nVeterans are encouraged to apply. We highly value the unique skills and experiences that veterans and transitioning service members can contribute to our team. We are proud to be recognised as a Veteran Friendly Employer by the Australian Government.\n\nEqual Opportunity Statement:\n\nAustralia:\n\nLockheed Martin Australia supports Equal Employment Opportunity and values diversity in the workplace by creating a place of employment that is, free of unlawful discrimination and is harassment free, fair, ethical, inclusive, and values the contribution of all its employees. By leveraging our employees’ unique talents and experiences, we will deliver innovative, affordable solutions and unparalleled customer value.\n\nAs part of our endeavours to increase participation of Indigenous Australians, we welcome applications from all people, including Aboriginal and Torres Strait Islander people.\n\nWe are committed to creating a workplace where everyone can thrive. If you are selected for this role, we would be happy to discuss any accommodations that will help you to be successful.\n\nNew Zealand/Asia/India:\n\nLockheed Martin supports Equal Employment Opportunity and values diversity in the workplace by creating a place of employment that is, free of unlawful discrimination and is harassment free, fair, ethical, inclusive, and values the contribution of all its employees. By leveraging our employees’ unique talents and experiences, we will deliver innovative, affordable solutions and unparalleled customer value."
}