{
  "positionName": "Software Engineer (Multiple Roles)",
  "company": "DEWC Services Pty Ltd",
  "posted": "11/02/2026",
  "type": "Full Time",
  "location": "Mawson Lakes",
  "link": "https://www.seek.com.au/job/90276720?type=standard&ref=search-standalone&origin=jobCard#sol=169b84f35e6d698e45de3640411394f57fa0462b",
  "description": "About Us:\n\nDEWC Services provides specialist Engineering and technical expertise across the Information Warfare domain to the Australian Defence Force (ADF) and Department of Defence.\n\nWe are a certified Great Place to Work™, employing over 95 high performing engineers, IT and business professionals who are passionate about delivering meaningful outcomes that support Australia’s Defence capability.\n\nOur culture is collaborative, professional and values driven. We prioritise employee wellbeing, flexible work arrangements, and continuous development, creating an environment where our people feel supported, trusted and empowered.\n\nThe Opportunity:\n\nDue to continued growth, DEWC Services is actively expanding its software engineering team to work at the forefront of cutting-edge defence technologies.\n\nWe have multiple openings for Software Engineers at all levels across Full stack, Back end, and Front end. We are seeking experience in Python, Java Spring Boot, Docker, and microservices architecture, as well as front-end development skills with modern JavaScript frameworks such as Angular, Vue, or Svelte.\n\nIf you find that you do not meet every one of the eligibility requirements listed below, we still encourage you to apply. We appreciate a diverse range of experiences and perspectives and are dedicated to evaluating the overall qualifications and potential of all candidates.\n\nKey Responsibilities:\n\nContribute and integrate with inter-disciplinary teams on both conventional and non-conventional projects, ensuring robust and scalable full-stack solutions.\nDesign, implement, and deploy high-performing full-stack applications within a microservices architecture in an agile environment, focusing on both front-end and back-end development.\nDevelop and maintain scalable and reliable front-end systems using modern JavaScript frameworks (e.g., Angular, Vue, or Svelte) to create responsive and user-friendly interfaces.\nBuild and maintain back-end services and APIs using Python, Java Spring Boot, ensuring seamless data flow and integration with front-end components.\nImplement and manage containerised applications using Docker, ensuring consistent and scalable deployment across different environments.\nCollaborate with DevOps teams to integrate CI/CD pipelines for automated testing, deployment, and monitoring of applications.\nEnsure the security and performance of both front-end and back-end systems through best practices in code quality, testing, and application monitoring.\nCollaborate with UX/UI designers, front-end developers, data engineers, and other stakeholders to deliver cohesive and efficient software solutions.\nParticipate in code reviews, providing and receiving constructive feedback to improve code quality and maintainability.\nStay updated with emerging technologies and industry trends, advocating for their adoption where beneficial.\nHave opportunities to undertake professional development, internal research and development, and work with a senior mentor.\n\nAbout You:\n\nAt DEWC Services, we value integrity, passion, and self-motivation in line with our company values above all, but at a minimum to develop your skills we require:\n\nBachelor's degree in Software Engineering, Computer Engineering, Computer Science, or equivalent.\nProven experience in full-stack software engineering, with demonstrable skills and experience in Python, Java, Docker, and modern JavaScript frameworks (e.g., Angular, Vue, or Svelte).\nStrong understanding and experience with microservices architecture and containerisation tools, particularly Docker.\nFamiliarity with cloud platforms (e.g., AWS, Azure) and their associated security principles and services.\nProficiency in software design, development, configuration management, and unit testing\nExperience working with relational (e.g., PostgreSQL, MySQL) and non-relational (e.g., MongoDB, Cassandra) databases, ORMs, and raw data sources.\nDemonstrated ability to integrate front-end and back-end components to create cohesive and efficient full-stack applications.\nExperience with version control systems (e.g., Git) and collaboration tools (e.g., JIRA, Confluence).\nStrong problem-solving skills and the ability to work effectively in a collaborative team environment.\nAbility to obtain and hold a AGSVA security clearance.\n\nIf you’re passionate about building high-performance software solutions and want to contribute to meaningful defence projects alongside some of the industry’s best minds, this is your opportunity to take your career to the next level.\n\nApplications close Sunday 13th of March 2026.\n\nPlease note, to be eligible for this role you must be an Australian Citizen to obtain and maintain an Australian Federal Government Security Clearance."
}