{
  "positionName": "Secure Software Engineer",
  "company": "G'day Group",
  "posted": "12/02/2026",
  "type": "Full Time",
  "location": "Adelaide SA",
  "link": "https://www.seek.com.au/job/90292067?type=standard&ref=search-standalone&origin=jobCard#sol=4aec1388cf6b476b393a44389a61f165349bbdff",
  "description": "Work options: Flexible\n\n\n\nAbout Us\n\nBe a part of the team revolutionizing Australian tourism! G'day Group, a leader in regional travel experiences, is looking for innovative thinkers to support Bookeasy, a vital business within the G'day Group, through our Support Office and tech teams. We provide digital solutions for regional tourism, making complexity simple. Tourism tech, made easy. That's what we deliver. If you're ready to use your tech skills to drive growth and employee well-being, join us! \n\nOur Benefits\n\n·      Health & Wellbeing: Flexible work, EAP, discounted health cover\n\n·      Generous Leave: Parental, volunteer, study leave, plus option to purchase more.\n\n·      Development Focus: Leadership programs, training support, professional memberships.\n\n·      Employee Savings: Discounts on accommodation, experiences, salary packaging.\n\n·      ESG Commitment: Fostering a safe workplace, community support, and environmental protection through a five-year strategy.\n\nYour New Role\n\nAs the Secure Software Engineer you will be responsible for contributing to the development, maintenance, and support of software solutions, ensuring high-quality code and effective solutions. You will work on new development projects, fixing bugs, and supporting existing systems in production. You will follow the technical designs and specifications provided and collaborate closely with the development team to achieve project goals. Coding will be focused on our PCI and ISO compliant environments and software.\n\nDevelop new features and enhancements in C# and .NET 10 (WebAPI, MVC), writing clean, maintainable code aligned with specs alongside senior developers and the Software Solutions Architect.\n\nIdentify, troubleshoot and resolve defects; ensure fixes are tested and verified prior to production release.\n\nProvide ongoing support and maintenance for production systems; monitor performance and stability and respond to issues promptly.\n\nCollaborate with the Software Development Team Leader and wider team; participate in code reviews, give/receive constructive feedback, and keep documentation current.\n\nDue to the secure nature of the work, applicants must be Australian citizens residing in Australia.\n\nYour Skills and Experience\n\nSoftware Development Experience: Intermediate experience in software development, particularly in the C# .NET ecosystem.\n\nFramework Proficiency: Experience developing web-based applications using .NET 8, WebAPI, and MVC frameworks.\n\nWeb Technologies: Familiarity with HTML, CSS, and JavaScript is a must for supporting front-end functionality.\n\nDatabase Knowledge: Familiarity with SQL Server and T-SQL, as well as basic knowledge of MySQL and RDS configurations.\n\nVersion Control: Experience using GitHub for version control and collaboration.\n\nJoin G'day Group: Disrupt, innovate, and ignite your career!\n\nPolice check & driver's licence required for this role."
}